[{"title": "NASA Mars Mission Connects With Bosnian and Herzegovinian Town", "preview": "A letter from NASA was presented to the mayor of Jezero, Bosnia-Herzegovina, honoring the connection between the town and Jezero Crater, the Mars 2020 rover landing site."}, {"title": "NASA Adds Return Sample Scientists to Mars 2020 Leadership Team", "preview": "The leadership council for Mars 2020 science added two new members who represent the interests of scientists destined to handle and study the first samples from Red Planet."}, {"title": "Join NASA for the Launch of the Mars 2020 Perseverance Rover", "preview": "No matter where you live, choose from a menu of activities to join NASA as we \"Countdown to Mars\" and launch the Perseverance rover to the Red Planet."}, {"title": "NASA's InSight 'Hears' Peculiar Sounds on Mars", "preview": "Listen to the marsquakes and other, less-expected sounds that the Mars lander has been detecting."}, {"title": "Mars Helicopter Attached to NASA's Perseverance Rover", "preview": "The team also fueled the rover's sky crane to get ready for this summer's history-making launch."}, {"title": "Deadline Closing for Names to Fly on NASA's Next Mars Rover", "preview": "You have until Sept. 30 to send your names to Mars aboard the Mars 2020 rover. "}, {"title": "My Culture, My Voice", "preview": "In honor of Hispanic Heritage Month, Christina Hernandez, an instrument engineer on the Mars 2020 mission, talks about her childhood and journey to NASA."}, {"title": "Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest", "preview": "Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite. "}, {"title": "Global Storms on Mars Launch Dust Towers Into the Sky", "preview": "A Mars Dust Tower Stands Out Dust storms are common on Mars. But every decade or so, something unpredictable happens: a series of runaway storms break out, covering the entire planet in a dusty haze."}, {"title": "NASA's Perseverance Rover 100 Days Out", "preview": "Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car."}, {"title": "InSight's 'Mole' Team Peers into the Pit", "preview": "Efforts to save the heat probe continue."}, {"title": "A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes", "preview": "Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition. "}, {"title": "Mars 2020 Unwrapped and Ready for More Testing", "preview": "In time-lapse video, bunny-suited engineers remove the inner layer of protective foil on NASA's Mars 2020 rover after it was relocated for testing."}, {"title": "NASA's Perseverance Rover Goes Through Trials by Fire, Ice, Light and Sound", "preview": "The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet."}, {"title": "NASA Perseverance Mars Rover Scientists Train in the Nevada Desert", "preview": "Team members searched for signs of ancient microscopic life there, just as NASA's latest rover will on the Red Planet next year."}]